// coded by opdo.vn
[a little]
b=ə'litl
c=det, pron
d=nhỏ, một ít
[aid]
b=eid
c=n, v
d=giúp đỡ; viện trợ
[aim]
b=eim
c=n, v
d=nhắm vào, nhằm vào, mục đích, mục tiêu
[aircraft]
b='eəkrɑ:ft
c=n
d=bất cứ máy móc hoặc cơ cấu nào bay được trên không và coi như một phương tiện đi lại hoặc chuyên chở; máy bay; tàu bay; khí cầu
[airport]
b='eəpɔ:t
c=n
d=sân bay, phi trường
[about]
b=ə'baut
c=adv, prep
d=khoảng, về
[ability]
b=ə'biliti
c=n
d=khả năng, năng lực, có tài
[abandon]
b=ə'bændən
c=v
d=từ bỏ; bỏ rơi; ruồng bỏ
[abandoned]
b=ə'bændənd
c=adj
d=từ bỏ; bỏ rơi; ruồng bỏ
[abuse]
b=ə'bju:s
c=n, v
d=sự) lạm dụng; đối xử tàn tệ; hành hạ; ngược đãi
[above]
b=ə'bʌv
c=prep, adv
d=trên, lên trên
[able]
b='eibl
c=adj
d=có thể
[abroad]
b=ə'brɔ:d
c=adv
d=nước ngoài, ra nước ngoài
[absolute]
b='æbsəlu:t
c=adj
d=tuyệt đối, hoàn toàn
[absolutely]
b='æbsəlu:tli
c=adv
d=tuyệt đối, hoàn toàn
[absence]
b='æbsəns
c=n
d=sự vắng mặt
[absent]
b='æbsənt
c=adj
d=vắng mặt, nghỉ
[absorb]
b=əb'sɔ:b
c=v
d=hút, hấp thu, hấp thụ
[acid]
b='æsid
c=n
d=axit
[academic]
b=,ækə'demik
c=adj
d=thuộc trường đại học
[account]
b=ə'kaunt
c=n, v
d=tài khoản; (số nhiều) sổ sách kế toán; bản kê khai
[accident]
b='æksidənt
c=n
d=tai nạn, rủi ro. by accident: tình cờ
[accidental]
b=,æksi'dentl
c=adj
d=tình cờ, bất ngờ
[accidentally]
b=,æksi'dentəli
c=adv
d=tình cờ, ngẫu nhiên
[accommodation]
b=ə,kɔmə'deiʃn
c=n
d=phòng ở, phòng đủ tiện nghi; sự thoả hiệp; điều chỉnh, thích nghi
[accompany]
b=ə'kʌmpəni
c=v
d=hộ tống, đi cùng, đi theo
[accent]
b='æksənt
c=n
d=trọng âm, dấu trọng âm
[accept]
b=ək'sept
c=v
d=chấp nhận, chấp thuận
[acceptable]
b=ək'septəbl
c=adj
d=có thể chấp nhận, chấp thuận
[accurate]
b='ækjurit
c=adj
d=đúng, chính xác
[accurately]
b='ækjuritli
c=adv
d=đúng đắn, chính xác
[according to]
b=ə'kɔ:diɳ
c=prep
d=theo, y theo
[accuse]
b=ə'kju:z
c=v
d=tố cáo, buộc tội, kết tội
[access]
b='ækses
c=n
d=lối, cửa, đường vào
[achieve]
b=ə'tʃi:v
c=v
d=đạt được, dành được, hoàn thành
[achievement]
b=ə'tʃi:vmənt
c=n
d=thành tích, thành tựu; đạt được, giành được; hoàn thành
[acknowledge]
b=ək'nɔlidʤ
c=v
d=công nhận, thừa nhận, chấp nhận
[acquire]
b=ə'kwaiə
c=v
d=được, có được, kiếm được (buy)
[across]
b=ə'krɔs
c=adv, prep
d=qua, ngang qua
[act]
b=ækt
c=n, v
d=hành động
[actual]
b='æktjuəl
c=adj
d=thật sự, thật, thực tế
[actually]
b='æktjuəli
c=adv
d=thực sự, trên thực tế
[action]
b='ækʃn
c=n
d=hành động
[actor]
b='æktə
c=n
d=diễn viên nam
[active]
b='æktiv
c=adj
d=hoạt động, năng động
[actively]
b='æktivli
c=adv
d=hoạt động, năng động
[activity]
b=æk'tiviti
c=n
d=hoạt động, năng động
[actress]
b='æktris
c=n
d=diễn viên nữ
[adult]
b='ədʌlt
c=n, adj
d=người trưởng thành, người lớn
[adapt]
b=ə'dæpt
c=v
d=tra, lắp vào, sửa lại cho hợp, thích nghi
[adopt]
b=ə'dɔpt
c=v
d=nhận làm con nuôi, bố mẹ nuôi
[adequate]
b='ædikwit
c=adj
d=đầy, đầy đủ
[adequately]
b='ædikwitli
c=adv
d=tương xứng, thỏa đáng, đầy đủ
[addition]
b=ə'diʃn
c=n
d=tính cộng, phép cộng, thêm vào
[additional]
b=ə'diʃənl
c=adj
d=thêm vào
[address]
b=ə'dres
c=n, v
d=địa chỉ, đề địa chỉ
[adjust]
b=ə'dʤʌst
c=v
d=sửa lại cho đúng, điều chỉnh
[admire]
b=əd'maiə
c=v
d=khâm phục, thán phục; ngắm nhìn một cách vui thích
[admiration]
b=,ædmə'reiʃn
c=n
d=khâm phục, thán phục; ngắm nhìn một cách vui thích
[admit]
b=əd'mit
c=v
d=nhận vào, cho vào; nhận, thừa nhận; thú nhận
[advice]
b=əd'vais
c=n
d=lời khuyên, lời chỉ bảo
[advance]
b=əd'vɑ:ns
c=n, v
d=sự tiến bộ, tiến lên; tăng lên
[advanced]
b=əd'vɑ:nst
c=adj
d=tiến bộ; tiên tiến, cao cấp
[advantage]
b=əb'vɑ:ntidʤ
c=n
d=lợi, lợi ích, lợi thế
[adventure]
b=əd'ventʃə
c=n
d=phiêu lưu, mạo hiểm, liều
[advertise]
b='ædvətaiz
c=v
d=thông báo, quảng cáo
[advertisement]
b=əd'və:tismənt
c=n
d=quảng cáo
[advertising]
b='ædvətaiziη
c=n
d=sự quảng cáo, nghề quảng cáo
[advise]
b=əd'vaiz
c=v
d=khuyên, khuyên bảo, răn bảo
[affair]
b=ə'feə
c=n
d=việc; chuyện tình cảm, chuyện yêu đương (thường là chuyện ngoại tình)
[affection]
b=ə'fekʃn
c=n
d=tình cảm, sự yêu mến
[afford]
b=ə'fɔ:d
c=v
d=đủ khả năng mua sắm cái gì, có thể, có đủ sức, có đủ khả năng, có đủ điều kiện (để làm gì); cho, cấp cho, ban cho
[afraid]
b=ə'freid
c=adj
d=sợ, sợ hãi, hoảng sợ
[after]
b='ɑ:ftə
c=prep, conj, adv
d=sau, đằng sau, sau khi
[afternoon]
b='ɑ:ftə'nu:n
c=n
d=buổi chiều
[afterwards]
b='ɑ:ftəwəd
c=adv
d=sau này, về sau, sau đấy
[age]
b=eidʤ
c=n
d=tuổi; tuổi già; thời đại; thời kỳ; kỷ nguyên
[ago]
b=ə'gou
c=adv
d=trước đây
[again]
b=ə'gen
c=adv
d=lại, nữa, lần nữa
[against]
b=ə'geinst
c=prep
d=chống lại, phản đối, ngược lại, tương phản
[aged]
b='eidʤid
c=adj
d=cao tuổi, lớn tuổi, người già
[agency]
b='eidʤənsi
c=n
d=cơ quan, đại lý, hãng
[agent]
b='eidʤənt
c=n
d=đại lý, nhân viên mật vụ; đặc vụ; trinh thám, (hóa học) tác nhân; chất
[aggressive]
b=ə'gresiv
c=adj
d=gây hấn, hùng hổ, hung hăng; xâm lược, tấn cônng; (từ
[agree]
b=ə'gri:
c=v
d=đồng ý, tán thành
[agreement]
b=ə'gri:mənt
c=n
d=sự đồng ý, tán thành; hiệp định, hợp đồng
[ahead]
b=ə'hed
c=adv
d=trước, phía trước
[alone]
b=ə'loun
c=adj, adv
d=cô đơn, một mình
[along]
b=ə'lɔɳ
c=prep, adv
d=dọc theo, theo; tiến lên về phía trước
[alarm]
b=ə'lɑ:m
c=n, v
d=báo động     
[alarmed]
b=ə'lɑ:m
c=adj
d=báo động     
[alarming]
b=ə'lɑ:miɳ
c=adj
d=làm hoảng sợ, gây hoang mang     
[alive]
b=ə'laiv
c=adj
d=còn sống; chưa chết     
[alcohol]
b='ælkəhɔl
c=n
d=rượu cồn     
[alcoholic]
b=,ælkə'hɔlik
c=adj, n
d=rượu; người nghiện rượu     
[all right]
b='ɔ:l'rait
c=adj, adv, exclamation
d=tốt, ổn, khỏe mạnh; được
[allied]
b=ə'laid
c=adj
d=liên minh, đồng minh     
[allow]
b=ə'lau
c=v
d=cho phép, để cho     
[ally]
b='æli
c=n, v
d=nước đồng minh, liên minh; liên kết, kết thông gia     
[almost]
b='ɔ:lmoust
c=adv
d=hầu như, gần như     
[PROGRAMWORDMEAN]
a little=a little
aid=aid
aim=aim
aircraft=aircraft
airport=airport
about=about
ability=ability
abandon=abandon
abandoned=abandoned
abuse=abuse
above=above
able=able
abroad=abroad
absolute=absolute
aged=aged
